{
    "moduleTitle": "Module 8: Robotics in Specific Industries",
    "moduleObjectives": [
        "Understand the application of robotics in various industries.",
        "Learn about the unique challenges and solutions in different industrial sectors.",
        "Apply knowledge of robotics to specific use cases in manufacturing, healthcare, agriculture, and service industries."
    ],
    "content": [
        {
            "title": "Robotics in Manufacturing",
            "paragraphs": [
                "Manufacturing is one of the earliest and most significant adopters of robotic technology. Industrial robots are used for tasks such as assembly, welding, painting, and material handling.",
                "Robots in manufacturing increase productivity, improve precision, and enhance safety by performing repetitive and dangerous tasks. Advances in robotics, such as collaborative robots (cobots), are enabling closer human-robot interaction on the factory floor."
            ]
        },
        {
            "title": "Robotics in Healthcare",
            "paragraphs": [
                "The healthcare industry is increasingly adopting robotics for various applications, including surgery, rehabilitation, and patient care. Surgical robots, for instance, provide high precision and minimally invasive procedures.",
                "Robots in healthcare assist healthcare professionals by performing routine tasks, allowing them to focus on patient care. Rehabilitation robots help patients recover mobility and strength, while companion robots provide support to the elderly and disabled."
            ]
        },
        {
            "title": "Robotics in Agriculture",
            "paragraphs": [
                "Agriculture is benefiting from robotics through precision farming, automated harvesting, and pest control. Robots equipped with sensors and AI can monitor crop health, apply fertilizers, and detect weeds.",
                "Robotic systems in agriculture increase efficiency, reduce labor costs, and minimize the environmental impact by optimizing resource use. Examples include autonomous tractors, drones for crop monitoring, and robotic harvesters."
            ]
        },
        {
            "title": "Robotics in Service and Retail",
            "paragraphs": [
                "The service and retail sectors are leveraging robotics to enhance customer experience, streamline operations, and perform tasks such as cleaning and delivery. Service robots are used in hotels, restaurants, and retail stores.",
                "Robots in these sectors interact with customers, provide information, and perform mundane tasks. Examples include robotic waiters, automated check-out systems, and delivery robots. These robots help businesses improve efficiency and customer satisfaction."
            ]
        }
    ],
    "additionalResources": {
        "textbookTitle": "Mastering AI Strategy: A Comprehensive Guide for Leaders",
        "textbookLink": "https://link-to-your-textbook.com"
    }
}
